vmux0.0.10/ycsbVMs_ycsb_8vms_bridge_-1rps_rep1/vm7.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6385 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6385 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-10-15 12:17:48:980 0 sec: 0 operations; est completion in 0 second 
2024-10-15 12:17:58:824 10 sec: 81879 operations; 8187.9 current ops/sec; est completion in 14 hours 34 minutes [READ: Count=40972, Max=44447, Min=95, Avg=118.77, 90=128, 99=165, 99.9=568, 99.99=4311] [UPDATE: Count=40912, Max=9647, Min=90, Avg=116.05, 90=125, 99=173, 99.9=827, 99.99=4003] 
2024-10-15 12:18:08:824 20 sec: 169855 operations; 8797.6 current ops/sec; est completion in 14 hours 2 minutes [READ: Count=43794, Max=1240, Min=98, Avg=113.5, 90=123, 99=144, 99.9=233, 99.99=485] [UPDATE: Count=44177, Max=3495, Min=94, Avg=110.59, 90=120, 99=142, 99.9=229, 99.99=579] 
2024-10-15 12:18:18:824 30 sec: 259192 operations; 8933.7 current ops/sec; est completion in 13 hours 48 minutes [READ: Count=44732, Max=7735, Min=88, Avg=112.13, 90=123, 99=139, 99.9=225, 99.99=423] [UPDATE: Count=44605, Max=420, Min=86, Avg=108.95, 90=120, 99=135, 99.9=225, 99.99=323] 
2024-10-15 12:18:28:824 40 sec: 347179 operations; 8798.7 current ops/sec; est completion in 13 hours 44 minutes [READ: Count=43845, Max=3363, Min=88, Avg=113.74, 90=124, 99=147, 99.9=232, 99.99=340] [UPDATE: Count=44142, Max=414, Min=89, Avg=110.81, 90=121, 99=153, 99.9=232, 99.99=337] 
2024-10-15 12:18:38:824 50 sec: 435129 operations; 8795 current ops/sec; est completion in 13 hours 41 minutes [READ: Count=43977, Max=4023, Min=94, Avg=113.78, 90=122, 99=156, 99.9=239, 99.99=337] [UPDATE: Count=43973, Max=3613, Min=89, Avg=110.88, 90=120, 99=164, 99.9=230, 99.99=327] 
2024-10-15 12:18:48:824 60 sec: 521649 operations; 8652 current ops/sec; est completion in 13 hours 42 minutes [READ: Count=43109, Max=4127, Min=96, Avg=115.68, 90=125, 99=214, 99.9=294, 99.99=356] [UPDATE: Count=43411, Max=2617, Min=97, Avg=112.74, 90=122, 99=212, 99.9=288, 99.99=413] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2024-10-15 12:18:49:837 61 sec: 530460 operations; 8697.93 current ops/sec; est completion in 13 hours 42 minutes [READ: Count=4383, Max=9679, Min=87, Avg=116.14, 90=125, 99=159, 99.9=277, 99.99=9679] [CLEANUP: Count=1, Max=896, Min=896, Avg=896, 90=896, 99=896, 99.9=896, 99.99=896] [UPDATE: Count=4428, Max=447, Min=88, Avg=110.19, 90=121, 99=152, 99.9=249, 99.99=447] 
[OVERALL], RunTime(ms), 61018
[OVERALL], Throughput(ops/sec), 8693.500278606312
[TOTAL_GCS_Copy], Count, 49
[TOTAL_GC_TIME_Copy], Time(ms), 21
[TOTAL_GC_TIME_%_Copy], Time(%), 0.03441607394539316
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 49
[TOTAL_GC_TIME], Time(ms), 21
[TOTAL_GC_TIME_%], Time(%), 0.03441607394539316
[READ], Operations, 264812
[READ], AverageLatency(us), 114.56745162605924
[READ], MinLatency(us), 87
[READ], MaxLatency(us), 44447
[READ], 95thPercentileLatency(us), 129
[READ], 99thPercentileLatency(us), 155
[READ], Return=OK, 264812
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 896.0
[CLEANUP], MinLatency(us), 896
[CLEANUP], MaxLatency(us), 896
[CLEANUP], 95thPercentileLatency(us), 896
[CLEANUP], 99thPercentileLatency(us), 896
[UPDATE], Operations, 265648
[UPDATE], AverageLatency(us), 111.58502604950912
[UPDATE], MinLatency(us), 86
[UPDATE], MaxLatency(us), 9647
[UPDATE], 95thPercentileLatency(us), 126
[UPDATE], 99thPercentileLatency(us), 161
[UPDATE], Return=OK, 265648
AUTOTEST_DONE